unfdemo.BS_Billing/src/InformationRegisters/BS_ТокеныПодключений/BS_ТокеныПодключений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>BS_ТокеныПодключений</name>
  <resources>
    <name>Токен</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>НастройкаБиллинга</name>
    <type>
      <types>CatalogRef.BS_НастройкиБиллинга</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

unfdemo.BS_Billing/src/CommonModules/bs_РаботаСAPIВызовСервера/Module.bsl
Функция ВызватьМетодAPI(Метод, Токен, ТипЗапроса) Экспорт
 	
	АдресРесурса = "/partner-api/v2"+Метод;
	
	ЗапросКAPI = СоздатьПодключениеКAPI(Токен,АдресРесурса);
		
	Соединение1 = Новый HTTPСоединение("service-api.1capp.com",,,,Новый ИнтернетПрокси,,Новый ЗащищенноеСоединениеOpenSSL);
	
	Если Нрег(ТипЗапроса) = "get" Тогда
		ОтветHTTP = Соединение1.Получить(ЗапросКAPI);
	ИначеЕсли Нрег(ТипЗапроса) = "post" Тогда
		ОтветHTTP = Соединение1.ОтправитьДляОбработки(ЗапросКAPI);
	КонецЕсли;
	
	ResponsesJson = ОтветHTTP.ПолучитьТелоКакСтроку();
	
	ЧтениеJSON = Новый ЧтениеJSON();
	ЧтениеJSON.УстановитьСтроку(ResponsesJson);
		
	Результат = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат Результат;
	
КонецФункции

Функция СоздатьПодключениеКAPI(Token,АдресРесурса)
 
	ЗапросКAPI = Новый HTTPЗапрос;
	ЗапросКAPI.Заголовки.Вставить("accept", "application/json");
	ЗапросКAPI.Заголовки.Вставить("Authorization", "Bearer "+Token);
	ЗапросКAPI.АдресРесурса = АдресРесурса;
	
	Возврат ЗапросКAPI;

КонецФункции

#Область РаботаСТокенами

Процедура ЗаписатьНовыйТокен(НастройкаБиллинга, Токен) Экспорт
	
	НоваяЗапись = РегистрыСведений.BS_ТокеныПодключений.СоздатьМенеджерЗаписи();
	НоваяЗапись.НастройкаБиллинга 	= НастройкаБиллинга;
	НоваяЗапись.Токен 					= Токен;
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

Функция ПолучитьТокен(НастройкаБиллинга) Экспорт
	
	Возврат РегистрыСведений.BS_ТокеныПодключений.Получить(Новый Структура("НастройкаБиллинга", НастройкаБиллинга)).Токен;
	
КонецФункции

#КонецОбласти
